{
  "past_and_future": [
    "Who was your role model growing up, and why?",
    "What challenges from your past have made you stronger?",
    "How have your past relationships influenced your views on love and commitment?",
    "What are your favorite family memories?",
    "What’s your earliest memory?",
    "What are the most important lessons you've learned in life?",
    "How have you handled change and uncertainty?",
    "What are your personal hopes and dreams for the future?",
    "How do you want to be remembered?",
    "What’s a defining moment in your life?",
    "How did your parents influence your views on relationships?"
  ],
  "personal_growth": [
    "What have you always wanted to try, but haven't yet?",
    "What’s your ideal way to spend a weekend?",
    "What are your biggest goals for the next five years?",
    "How do you handle stress and challenges?",
    "Who’s been the most important mentor in your career?",
    "Who are the most influential people in your life?",
    "What are your favorite hobbies or activities?",
    "How do you define success?",
    "What motivates you?",
    "What one habit do you have that you’d like to change?",
    "What skill would you like to master?",
    "What’s the best advice you’ve ever received?",
    "What are your personal boundaries and how do you maintain them?"
  ],
  "dreams_and_ambitions": [
    "What’s your dream job and why?",
    "If you could start any business, what would it be?",
    "What project have you always wanted to start?",
    "Where do you see yourself in 10 years?",
    "Where have you always dreamed of visiting?",
    "What’s your biggest career ambition?",
    "How do you plan to achieve your dreams?",
    "What’s your biggest goal in life?",
    "What goal are you currently working toward?",
    "What would you do if you had unlimited resources?",
    "Who inspires you to follow your dreams?",
    "What’s the most daring thing you’ve ever done?",
    "What’s one thing you hope to accomplish in the next year?"
  ],
  "values_and_emotional_intimacy": [
    "What are your biggest fears and how do you cope with them?",
    "What’s something you’ve never told anyone else before?",
    "How do you express your emotions?",
    "What does emotional intimacy mean to you?",
    "What values are most important to you?",
    "What values do you appreciate in others?",
    "What are your thoughts on vulnerability in a relationship?",
    "How do you feel when we spend time apart?",
    "How much quality time together feels right to you, and why?",
    "What makes you feel secure in our relationship?",
    "How do you handle feelings of jealousy or insecurity?",
    "What’s your love language?",
    "How do you feel about sharing your thoughts and feelings?",
    "What makes you feel most connected to him/her?"
  ],
  "just_for_fun": [
    "If you could have dinner with any three people, dead or alive, who would they be?",
    "What's your favorite movie of all time and why?",
    "If you could travel anywhere in the world right now, where would you go?",
    "If you could have any superpower, what would it be?",
    "What's your favorite way to relax?",
    "If you could live in any historical period, which one would you choose?",
    "Who was your first celebrity crush?",
    "If you won the lottery, what would you do first?",
    "What are most people surprised to learn about you?",
    "What’s your favorite game?",
    "If you could instantly learn any skill, what would it be?",
    "What food could you eat every day?",
    "If you could be any animal for a day, what would you be?",
    "What’s the funniest thing that’s ever happened to you?"
  ]
}
